In [1]:
import pandas as pd
import numpy as np
import os
import subprocess

In [2]:
! python3 --version
! pip3 --version

Python 3.13.9
pip 25.3 from /opt/anaconda3/lib/python3.13/site-packages/pip (python 3.13)

In [3]:
cur_dir = os.getcwd()
path = os.path.abspath(os.getcwd())

In [4]:
! pip3 install --upgrade pip
! pip3 install openpyxl
! pip3 install sqlalchemy
! pip3 install psycopg2-binary
! pip3 install fastparquet
! pip3 install lxml

Requirement already satisfied: pip in /opt/anaconda3/lib/python3.13/site-packages (25.3)
Requirement already satisfied: openpyxl in /opt/anaconda3/lib/python3.13/site-packages (3.1.5)
Requirement already satisfied: et_xmlfile in /opt/anaconda3/lib/python3.13/site-packages (from openpyxl) (1.1.0)
Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.13/site-packages (2.0.39)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.13/site-packages (from sqlalchemy) (4.12.2)
Collecting psycopg2-binary
  Downloading psycopg2_binary-2.9.11-cp313-cp313-macosx_11_0_arm64.whl.metadata (4.9 kB)
Downloading psycopg2_binary-2.9.11-cp313-cp313-macosx_11_0_arm64.whl (3.9 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3.9/3.9 MB 47.1 MB/s  0:00:00
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.11
Requirement already satisfied: fastparquet in /opt/anaconda3/lib/python3.13/site-packages (2024.11.0)
Requirement already satisfied: pandas>=1.5.0 in /opt/anaconda3/lib/python3.13/site-packages (from fastparquet) (2.2.3)
Requirement already satisfied: numpy in /opt/anaconda3/lib/python3.13/site-packages (from fastparquet) (2.1.3)
Requirement already satisfied: cramjam>=2.3 in /opt/anaconda3/lib/python3.13/site-packages (from fastparquet) (2.11.0)
Requirement already satisfied: fsspec in /opt/anaconda3/lib/python3.13/site-packages (from fastparquet) (2025.3.2)
Requirement already satisfied: packaging in /opt/anaconda3/lib/python3.13/site-packages (from fastparquet) (24.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda3/lib/python3.13/site-packages (from pandas>=1.5.0->fastparquet) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda3/lib/python3.13/site-packages (from pandas>=1.5.0->fastparquet) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda3/lib/python3.13/site-packages (from pandas>=1.5.0->fastparquet) (2025.2)
Requirement already satisfied: six>=1.5 in /opt/anaconda3/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas>=1.5.0->fastparquet) (1.17.0)
Requirement already satisfied: lxml in /opt/anaconda3/lib/python3.13/site-packages (5.3.0)

In [5]:
dconn_str = "postgresql://avnadmin:AVNS_ZdDb93Yjx6l0LlnITsX@pg-230e9f42-jonas-syntra.b.aivencloud.com:23448/defaultdb?sslmode=require"

1. CSV-files
2. Excel-files
3. Parquet files
4. SQL Databases

## 1. CSV-files
Comma seperated files

### 1.1 Reading
#### 1.2 Basic cases
- data inlezen
- header kiezen
- index kiezen
- omgaan met missing data
- type casting
- selective reading

In [6]:
df = pd.read_csv(f'{path}/data/df1.csv')
df.head()

     name  age  score        date  value
0    Alex   20     50  01-12-2024    100
1   Robin   21     51  02-12-2024    101
2     Sam   22     52  03-12-2024    102
3   Jamie   23     53  04-12-2024    103
4  Taylor   24     54  05-12-2024    104

In [7]:
pd.read_csv(f'{path}/data/df1.csv', header=1)

      Alex  20  50  01-12-2024  100
0    Robin  21  51  02-12-2024  101
1      Sam  22  52  03-12-2024  102
2    Jamie  23  53  04-12-2024  103
3   Taylor  24  54  05-12-2024  104
4    Casey  25  55  06-12-2024  105
5   Jordan  26  56  07-12-2024  106
6      NaN  27  57  08-12-2024  107
7    Riley  28  58  09-12-2024  108
8  UNKNOWN  29  59  10-12-2024  109

In [8]:
pd.read_csv(f'{path}/data/df1.csv', usecols=list(range(0,1))+[2])

      name  score
0     Alex     50
1    Robin     51
2      Sam     52
3    Jamie     53
4   Taylor     54
5    Casey     55
6   Jordan     56
7      NaN     57
8    Riley     58
9  UNKNOWN     59

In [9]:
pd.read_csv(f'{path}/data/df1.csv', index_col=0)

         age  score        date  value
name
Alex      20     50  01-12-2024    100
Robin     21     51  02-12-2024    101
Sam       22     52  03-12-2024    102
Jamie     23     53  04-12-2024    103
Taylor    24     54  05-12-2024    104
Casey     25     55  06-12-2024    105
Jordan    26     56  07-12-2024    106
NaN       27     57  08-12-2024    107
Riley     28     58  09-12-2024    108
UNKNOWN   29     59  10-12-2024    109

In [10]:
pd.read_csv(f'{path}/data/df1.csv')

      name  age  score        date  value
0     Alex   20     50  01-12-2024    100
1    Robin   21     51  02-12-2024    101
2      Sam   22     52  03-12-2024    102
3    Jamie   23     53  04-12-2024    103
4   Taylor   24     54  05-12-2024    104
5    Casey   25     55  06-12-2024    105
6   Jordan   26     56  07-12-2024    106
7      NaN   27     57  08-12-2024    107
8    Riley   28     58  09-12-2024    108
9  UNKNOWN   29     59  10-12-2024    109

In [11]:
df = pd.read_csv(f'{path}/data/df1.csv', na_values=['UNKNOWN'])

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    8 non-null      object
 1   age     10 non-null     int64
 2   score   10 non-null     int64
 3   date    10 non-null     object
 4   value   10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [13]:
test = pd.read_csv(f'{path}/data/df1.csv', dtype={'age':float})

In [14]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    9 non-null      object
 1   age     10 non-null     float64
 2   score   10 non-null     int64
 3   date    10 non-null     object
 4   value   10 non-null     int64
dtypes: float64(1), int64(2), object(2)
memory usage: 532.0+ bytes

In [15]:
df_without = pd.read_csv(f'{path}/data/df1.csv')
df_with = pd.read_csv(f'{path}/data/df1.csv', parse_dates=['date']
                      , date_format='%d-%m-%Y')

In [16]:
df_without.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    9 non-null      object
 1   age     10 non-null     int64
 2   score   10 non-null     int64
 3   date    10 non-null     object
 4   value   10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 532.0+ bytes

In [17]:
# df_without['date'].dt.month

In [18]:
df_with['date'].dt.day_name()

0       Sunday
1       Monday
2      Tuesday
3    Wednesday
4     Thursday
5       Friday
6     Saturday
7       Sunday
8       Monday
9      Tuesday
Name: date, dtype: object

In [19]:
cur_dir

'/Users/jonas/PycharmProjects/Data_Scientist_Syntra/2.data_manipulation_with_pandas/les4'

In [20]:
pd.read_csv(f'{path}/data/df1.csv', skiprows=2)

     Robin  21  51  02-12-2024  101
0      Sam  22  52  03-12-2024  102
1    Jamie  23  53  04-12-2024  103
2   Taylor  24  54  05-12-2024  104
3    Casey  25  55  06-12-2024  105
4   Jordan  26  56  07-12-2024  106
5      NaN  27  57  08-12-2024  107
6    Riley  28  58  09-12-2024  108
7  UNKNOWN  29  59  10-12-2024  109

#### 1.1.2 Special cases
- different seperator
- Bad lines
- diffent encoding

### 1.2 Writing

## 2. Excel
### 2.1 Reading
- Excel-formules worden niet uitgevoerd, enkel value ingelezen. Zelfde met formatting

### 2.2 Writing

## 3. SQL
### 3.1 Reading

### 3.2 Writing

## 4. Other formats